In [5]:
import pandas as pd
import numpy as np

In [2]:
from sqlalchemy import create_engine

In [14]:
temp_db = create_engine('sqlite:///:memory:')

In [9]:
pd.DataFrame(data=np.random.randint(low=0, high=100, size=(4, 4)), columns=['a', 'b', 'c', 'd'])

    a   b   c   d
0  94  29  74  57
1  90  50  93  12
2  62  71  37   7
3   9   8  32  49

In [10]:
df = pd.DataFrame(data=np.random.randint(low=0, high=100, size=(4, 4)), columns=['a', 'b', 'c', 'd'])

In [15]:
df.to_sql(name='new_table', con=temp_db)

In [22]:
df.to_sql(name='new_table', con=temp_db, index=False, if_exists='replace') # dangerous!!!

In [23]:
pd.read_sql(sql='new_table', con=temp_db)

    a   b   c   d
0  58  33  85  77
1   8  74   8  92
2  24  62  81  69
3  25  71  98  42

In [24]:
new_df = pd.read_sql(sql='new_table', con=temp_db)

In [25]:
new_df

    a   b   c   d
0  58  33  85  77
1   8  74   8  92
2  24  62  81  69
3  25  71  98  42

In [27]:
pd.read_sql_query(sql='SELECT a, c FROM new_table', con=temp_db)

    a   c
0  58  85
1   8   8
2  24  81
3  25  98

In [28]:
result = pd.read_sql_query(sql='SELECT a, c FROM new_table', con=temp_db)

In [30]:
result

    a   c
0  58  85
1   8   8
2  24  81
3  25  98